## Importando Bibliotecas

In [1]:
import pandas as pd
from sklearn import linear_model
import matplotlib.pyplot as plt

In [ ]:
## importando novo dataset com novas colunas (quantidade de observação, lat & lon, e aprovação do dado)

In [2]:
data1 = pd.read_csv('ebd_BR_relFeb-2021.txt', sep='\t', usecols = ['COMMON NAME', 'SCIENTIFIC NAME', 'OBSERVATION COUNT', 'LATITUDE','LONGITUDE' , 'OBSERVATION DATE'])

In [3]:
data1.head(10)

,COMMON NAME,SCIENTIFIC NAME,OBSERVATION COUNT,LATITUDE,LONGITUDE,OBSERVATION DATE
0,Black Noddy,Anous minutus,X,0.916828,-29.345435,2007-10-26
1,Brown Booby,Sula leucogaster,X,0.916828,-29.345435,2007-10-26
2,Brown Noddy,Anous stolidus,X,0.916828,-29.345435,2007-10-26
3,Leach's Storm-Petrel,Oceanodroma leucorhoa,X,0.916828,-29.345435,2007-10-26
4,Magnificent Frigatebird,Fregata magnificens,X,0.916828,-29.345435,2007-10-26
5,Manx Shearwater,Puffinus puffinus,X,0.916828,-29.345435,2007-10-26
6,Sooty Tern,Onychoprion fuscatus,X,0.916828,-29.345435,2007-10-26
7,South Polar Skua,Stercorarius maccormicki,X,0.916828,-29.345435,2007-10-26
8,Bulwer's Petrel,Bulweria bulwerii,7,0.918781,-29.345525,2019-01-18
9,Cory's Shearwater,Calonectris diomedea,2,0.918781,-29.345525,2019-01-18

## procurando procurando e excluindo dados reprovados

In [4]:
data2 = pd.read_csv('ebd_BR_relFeb-2021.txt', sep='\t', usecols = ['COMMON NAME', 'APPROVED'])

In [5]:
data2.describe()

        APPROVED
count  8170994.0
mean         1.0
std          0.0
min          1.0
25%          1.0
50%          1.0
75%          1.0
max          1.0

In [7]:
data2['APPROVED'].value_counts()

1    8170994
Name: APPROVED, dtype: int64

In [11]:
data2['APPROVED'] == 2

0          False
1          False
2          False
3          False
4          False
           ...
8170989    False
8170990    False
8170991    False
8170992    False
8170993    False
Name: APPROVED, Length: 8170994, dtype: bool

In [13]:
data2[data2['APPROVED'] == 1]['APPROVED'].value_counts()

1    8170994
Name: APPROVED, dtype: int64

In [14]:
data2[data2['APPROVED'] == 0]['APPROVED'].value_counts()

Series([], Name: APPROVED, dtype: int64)

In [3]:
data1.shape

(8170994, 6)

## Data set somente com dados aprovados
Transformando a coluna de contagem de obeservação em numeros int

In [4]:
def count_x(linha):
    if linha == 'X':
        return 1
    else:
        return linha

In [5]:
data1['OBSERVATION COUNT'] = data1['OBSERVATION COUNT'].apply(count_x)

In [6]:
data1['OBSERVATION COUNT'] = data1['OBSERVATION COUNT'].astype(int)

In [7]:
data1.head()

,COMMON NAME,SCIENTIFIC NAME,OBSERVATION COUNT,LATITUDE,LONGITUDE,OBSERVATION DATE
0,Black Noddy,Anous minutus,1,0.916828,-29.345435,2007-10-26
1,Brown Booby,Sula leucogaster,1,0.916828,-29.345435,2007-10-26
2,Brown Noddy,Anous stolidus,1,0.916828,-29.345435,2007-10-26
3,Leach's Storm-Petrel,Oceanodroma leucorhoa,1,0.916828,-29.345435,2007-10-26
4,Magnificent Frigatebird,Fregata magnificens,1,0.916828,-29.345435,2007-10-26

In [8]:
data1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8170994 entries, 0 to 8170993
Data columns (total 6 columns):
 #   Column             Dtype
---  ------             -----
 0   COMMON NAME        object
 1   SCIENTIFIC NAME    object
 2   OBSERVATION COUNT  int32
 3   LATITUDE           float64
 4   LONGITUDE          float64
 5   OBSERVATION DATE   object
dtypes: float64(2), int32(1), object(3)
memory usage: 342.9+ MB

In [9]:
 data1.isnull().sum()

COMMON NAME          0
SCIENTIFIC NAME      0
OBSERVATION COUNT    0
LATITUDE             0
LONGITUDE            0
OBSERVATION DATE     0
dtype: int64

## Transformando coluna da data observação de objt para datetime

In [10]:
data1['OBSERVATION DATE'] = pd.to_datetime(data1['OBSERVATION DATE'])

In [11]:
data1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8170994 entries, 0 to 8170993
Data columns (total 6 columns):
 #   Column             Dtype
---  ------             -----
 0   COMMON NAME        object
 1   SCIENTIFIC NAME    object
 2   OBSERVATION COUNT  int32
 3   LATITUDE           float64
 4   LONGITUDE          float64
 5   OBSERVATION DATE   datetime64[ns]
dtypes: datetime64[ns](1), float64(2), int32(1), object(2)
memory usage: 342.9+ MB

In [32]:
##Transformação da data inteira para o ano
##data1['YEAR'] = data1['OBSERVATION DATE'].dt.year

In [25]:
## apagando segunda coluna criada com a quantidade de observação data1.drop(columns=['OBSERVATION COUNT 2'])

In [27]:
## Agrupando dados data1.groupby(['SCIENTIFIC NAME', 'LATITUDE','LONGITUDE', 'year'], as_index=False).count()

In [ ]:
### Salvando o arquivo para abrir no Tableau

In [12]:
data1.head()

,COMMON NAME,SCIENTIFIC NAME,OBSERVATION COUNT,LATITUDE,LONGITUDE,OBSERVATION DATE
0,Black Noddy,Anous minutus,1,0.916828,-29.345435,2007-10-26
1,Brown Booby,Sula leucogaster,1,0.916828,-29.345435,2007-10-26
2,Brown Noddy,Anous stolidus,1,0.916828,-29.345435,2007-10-26
3,Leach's Storm-Petrel,Oceanodroma leucorhoa,1,0.916828,-29.345435,2007-10-26
4,Magnificent Frigatebird,Fregata magnificens,1,0.916828,-29.345435,2007-10-26

In [13]:
df = data1.drop(columns=['COMMON NAME'])

In [38]:
df.to_csv('projeção_de_abundancia2.csv', sep='\t', encoding='utf-8', index=False)

## Criando uma pequena base para testes de vizualizações (sabias)

In [29]:
df4 = data1.drop(columns=['COMMON NAME'])

In [31]:
df4

,SCIENTIFIC NAME,OBSERVATION COUNT,LATITUDE,LONGITUDE,OBSERVATION DATE
0,Anous minutus,1,0.916828,-29.345435,2007-10-26
1,Sula leucogaster,1,0.916828,-29.345435,2007-10-26
2,Anous stolidus,1,0.916828,-29.345435,2007-10-26
3,Oceanodroma leucorhoa,1,0.916828,-29.345435,2007-10-26
4,Fregata magnificens,1,0.916828,-29.345435,2007-10-26
...,...,...,...,...,...
8170989,Cacicus cela,4,-9.858650,-48.663900,2021-02-21
8170990,Cacicus cela,9,-9.979333,-50.036545,2021-02-22
8170991,Melanerpes cruentatus,4,-11.585900,-48.082118,2021-02-16
8170992,Hemitriccus minimus,1,-9.979333,-50.036545,2021-02-23
8170993,Hemitriccus minimus,1,-9.979333,-50.036545,2021-02-23

In [19]:
mks_teste = df4['SCIENTIFIC NAME'] == 'Turdus flavipes'

In [34]:
data4 = df4[mks_teste]

In [35]:
data4

,SCIENTIFIC NAME,OBSERVATION COUNT,LATITUDE,LONGITUDE,OBSERVATION DATE
492195,Turdus flavipes,1,-15.195380,-39.058843,1999-06-06
493095,Turdus flavipes,1,-15.170063,-39.533615,1999-11-02
498986,Turdus flavipes,1,-14.365026,-40.207334,2004-02-23
499431,Turdus flavipes,1,-14.413223,-40.134543,2004-06-15
499432,Turdus flavipes,1,-14.492222,-39.135833,2004-06-07
...,...,...,...,...,...
8051751,Turdus flavipes,1,-23.395798,-46.259755,2021-02-20
8051752,Turdus flavipes,4,-23.810413,-46.457585,2021-02-15
8051753,Turdus flavipes,1,-23.772801,-46.290759,2021-02-20
8051754,Turdus flavipes,3,-24.268210,-48.412757,2021-02-22
8051755,Turdus flavipes,18,-23.772801,-46.290759,2021-02-27

In [24]:
data4.to_csv('projeção_de_abundancia_teste2.csv', sep='\t', encoding='utf-8', index=False)